case/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 1 -1 -2 0 0 0 0 ];

internalField   uniform 1.0e+5;

boundaryField
{
    top
    {
        type            buoyantPressure;
        value           uniform 1.0e+5;
    }

    bottom
    {
        type            buoyantPressure;
        value           uniform 1.0e+5;
    }

    left
    {
        type            buoyantPressure;
        value           uniform 1.0e+5;
    }

    right
    {
        type            buoyantPressure;
        value           uniform 1.0e+5;
    }
}


// ************************************************************************* //
