case/constant/chamber/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    top
    {
        type            wall;
        nFaces          72;
        startFace       34248;
    }
    bottom
    {
        type            wall;
        nFaces          72;
        startFace       34320;
    }
    frontAndBack
    {
        type            empty;
        nFaces          34560;
        startFace       34392;
    }
    chamber_to_leftSolid
    {
        type            directMappedWall;
        nFaces          240;
        startFace       68952;
        sampleMode      nearestPatchFace;
        sampleRegion    leftSolid;
        samplePatch     leftSolid_to_chamber;
        offset          (0 0 0);
    }
    chamber_to_rightSolid
    {
        type            directMappedWall;
        nFaces          240;
        startFace       69192;
        sampleMode      nearestPatchFace;
        sampleRegion    rightSolid;
        samplePatch     rightSolid_to_chamber;
        offset          (0 0 0);
    }
)


// ************************************************************************* //
